Tekla Open API Reference for Tekla Structures 2025
ReferenceModel.BasePointGuid Property
 The GUID of the used base point. Empty if base point is not used.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Guid BasePointGuid { get; set; }
Public Property BasePointGuid As Guid
	Get
	Set
Property Value
Type: Guid
See Also
Reference
ReferenceModel Class
Tekla.Structures.Model Namespace